CS-3383/notes/html_output/4 - Formal Language.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-03 Mon 15:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="kiera" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc1e27e3">1. Formal Language</a></li>
<li><a href="#orgf80ebea">2. Finite Automata</a>
<ul>
<li>
<ul>
<li><a href="#org2202959">2.0.1. Basic model for this &ldquo;door&rdquo; machine:</a></li>
</ul>
</li>
<li><a href="#org1569d08">2.1. Deterministic Finite Automata</a>
<ul>
<li><a href="#org679573e">2.1.1. DFA Configuratons</a></li>
<li><a href="#org7e841e7">2.1.2. Examples</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1e27e3" class="outline-2">
<h2 id="orgc1e27e3"><span class="section-number-2">1.</span> Formal Language</h2>
<div class="outline-text-2" id="text-1">
<p>
Suffix, Prefix, Strings
</p>

<p>
Kleene star language operation.
</p>

<p>
Complement: For \(L \in \Sigma^*, \bar L = \Sigma^* - L\)
\(L^*\): The set of all strings obtained by concatenating zero or more strings of \(L\)
</p>
<ul class="org-ul">
<li>\(\Sigma^*\): \(w\in\Sigma^*\)</li>
<li>\(\Sigma^*\): \(w\in\Sigma\) = all the strings</li>
</ul>
</div>
</div>
<div id="outline-container-orgf80ebea" class="outline-2">
<h2 id="orgf80ebea"><span class="section-number-2">2.</span> Finite Automata</h2>
<div class="outline-text-2" id="text-2">
<p>
Automata are automatic machines. Example:
</p>
<ul class="org-ul">
<li>An automatic door that opens in one direction. Not a sliding door, but rather an opening one (in one direction.)</li>
<li>What is a door? An entrance/exit.</li>
<li>What is an automatic door? A door which requires no human interaction.</li>
</ul>
</div>
<div id="outline-container-org2202959" class="outline-4">
<h4 id="org2202959"><span class="section-number-4">2.0.1.</span> Basic model for this &ldquo;door&rdquo; machine:</h4>
<div class="outline-text-4" id="text-2-0-1">
<ul class="org-ul">
<li>Open to let people in</li>
<li>Do not knock people on opening side.</li>
<li>Check front people? Yes/no</li>
<li>Check rear people? Yes/no</li>
<li>Check current status? Open/close</li>
<li>Determine the next status? Open/close</li>
</ul>

<p>
\(Q\) is a finite set of states
\(\Sigma\) is an alphabet
\(q_0 \in Q\) is the initial state.
\(F\subseteq Q\) is the set of final/accept states (can be multiple.)
</p>

<p>
\(\delta\)
</p>

<p>
Example:
</p>
<ul class="org-ul">
<li>\(Q=\{q_1,q_2,q_3\}\)</li>
<li>\(\Sigma=\{0,1\}\)</li>
<li>\(\delta\)</li>
<li>\(q_0=q_1\)</li>
<li>\(F=\{q_2\}\)</li>
</ul>

<p>
\(\delta=\cdots\)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">\(q_n\)</th>
<th scope="col" class="org-left">0</th>
<th scope="col" class="org-left">1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(q_1\)</td>
<td class="org-left">\(q_1\)</td>
<td class="org-left">\(q_2\)</td>
</tr>

<tr>
<td class="org-left">\(q_2\)</td>
<td class="org-left">\(q_3\)</td>
<td class="org-left">\(q_2\)</td>
</tr>

<tr>
<td class="org-left">\(q_3\)</td>
<td class="org-left">\(q_2\)</td>
<td class="org-left">\(q_2\)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1569d08" class="outline-3">
<h3 id="org1569d08"><span class="section-number-3">2.1.</span> Deterministic Finite Automata</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A deterministic finite automaton \(M\) can be viewed as a classifier that filters out all the strings it accepts.
</p>
<ul class="org-ul">
<li>The set \(A\) of all the strings \(M\) accepts is the <b>language of machine</b> \(M\).</li>
<li>Denote as \(L(M)=A\). (language of your automata \(M\).)</li>
<li>\(M\) recognises/accepts \(A\).</li>
</ul>
</div>
<div id="outline-container-org679573e" class="outline-4">
<h4 id="org679573e"><span class="section-number-4">2.1.1.</span> DFA Configuratons</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Configuration for a DFA \(M=(K,\Sigma,\delta,s,F)\)
</p>
<ul class="org-ul">
<li>any element of \(K\times\Sigma^*\)</li>
<li>The state of DFA currently</li>
<li>The remaining part of the string to be processed.</li>
</ul>
</div>
</div>
<div id="outline-container-org7e841e7" class="outline-4">
<h4 id="org7e841e7"><span class="section-number-4">2.1.2.</span> Examples</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
<ol class="org-ol">
<li><a id="org4bdfd6c"></a>Example 1<br />
<div class="outline-text-5" id="text-2-1-2-1">
<ul class="org-ul">
<li>\(Q=\{q_0,q_1,q_2,q_3\}\)</li>
<li>\(\Sigma=\{a,b\}\)</li>
<li>\(\delta= \{((q_0,a),q_1),((q_0,b),q_0),\cdots,((q_3,b),q_3)\}\)</li>
<li>\(\cdots\)</li>
</ul>
</div>
</li>
<li><a id="org2a4c706"></a>Example 2<br />
<div class="outline-text-5" id="text-2-1-2-2">
<p>
Input string: \(aabba\)
</p>

\begin{matrix}
$(q_0,aabba)\implies$ & $(q_0,abba)$\\
$\cdots\implies$ & $(q_0,bba)$\\
$\cdots\implies$ & $(q_1,ba)$\\
$\cdots\implies$ & $(q_0,a)$\\
$\cdots\implies$ & $(q_0,e)$\\
\end{matrix}
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: kiera</p>
<p class="date">Created: 2025-02-03 Mon 15:47</p>
</div>
</body>
</html>
